daily/2022-05-24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-21 Wed 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2022-05-24</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">2022-05-24</h1>

<div id="outline-container-org1011c87" class="outline-2">
<h2 id="org1011c87">API for variational inference in `blackjax`</h2>
<div class="outline-text-2" id="text-org1011c87">
<p>
Can <a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/Variational_Bayesian_methods">variational inference</a> (VI) be represented with a kernel? MCMC algorithms are represented as such, for instance for SGLD:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> blackjax

<span style="color: #DFAF8F;">sgld</span> = blackjax.sgld(grad_fn, schedule_fn)
<span style="color: #DFAF8F;">state</span> = sgld.init(init_position, data_batch)
<span style="color: #DFAF8F;">new_state</span> = sgld.step(rng_key, state, data_batch)

</pre>
</div>

<p>
However, VI is not a stepping process like MCMC is. It <i>creates a distribution object</i> via optimization and then draws samples from that object.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> blackjax

<span style="color: #DFAF8F;">pathfinder</span> = blackjax.pathfinder(logprob_fn)
<span style="color: #DFAF8F;">approximation</span> = pathfinder.approximate(initial_points, num_steps)
<span style="color: #DFAF8F;">samples</span> = pathfinder.sample(approximation, num_samples)
</pre>
</div>
</div>
</div>

<div id="outline-container-org70e1e4b" class="outline-2">
<h2 id="org70e1e4b">Links to this note</h2>
</div>
</div>
</body>
</html>